# Linear Regression in TensorFlow

In [11]:
from __future__ import absolute_import, division, print_function, unicode_literals

In [12]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from IPython.display import clear_output
from six.moves import urllib

import tensorflow.compat.v2.feature_column as fc
import tensorflow as tf

### Load in the training and testing data

In [21]:
# Training dataset
dftrain = pd.read_csv("data/titanic-train.csv")

In [22]:
# Testing dataset
dfeval = pd.read_csv("data/titanic-eval.csv")

### Remove and return the columns of data that we are trying to predict from both the training and testing data
In our case, whether or not the passenger survived or not

In [23]:
y_train = dftrain.pop("survived")
y_eval = dfeval.pop("survived")

### Let's explore the dataset a bit

In [24]:
# Look at the first few rows of the dataframe with all columns
dftrain.head()

,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,female,35.0,1,0,53.1000,First,C,Southampton,n
4,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y

In [25]:
# Look at the first row in dftrain
dftrain.loc[0]

sex                          male
age                            22
n_siblings_spouses              1
parch                           0
fare                         7.25
class                       Third
deck                      unknown
embark_town           Southampton
alone                           n
Name: 0, dtype: object

In [28]:
# Look at the corresponding row (first) in y_train
y_train.loc[0]

0

In [29]:
# Look at a specific column -- say, the age column
dftrain['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      28.0
       ...
622    28.0
623    25.0
624    19.0
625    28.0
626    32.0
Name: age, Length: 627, dtype: float64

In [31]:
# Describe the dataset a bit to get some statistics 
dftrain.describe()

              age  n_siblings_spouses       parch        fare
count  627.000000          627.000000  627.000000  627.000000
mean    29.631308            0.545455    0.379585   34.385399
std     12.511818            1.151090    0.792999   54.597730
min      0.750000            0.000000    0.000000    0.000000
25%     23.000000            0.000000    0.000000    7.895800
50%     28.000000            0.000000    0.000000   15.045800
75%     35.000000            1.000000    0.000000   31.387500
max     80.000000            8.000000    5.000000  512.329200

In [32]:
# Get the shape of the data -- number of rows and columns
dftrain.shape

(627, 9)

### Some preliminary data visualizations